In [1]:
import numpy as np 
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

### ***Feature Engineering***

        ## - So far we have performed feature analysis

                    + Data frame qick check 
                    + cCategorical column analysis 
                    + Bar charts
                    + Pie charts
                    + Numerical column analysis 
                    + Histograms, box plots, outliers
                    + Bi - multi variate anaalysis
                    + correlation etc.

        ## - Noe we neeed ot learn Feature Engineering 

                    + we will create a new columns for better ML models 
                    + we will perform the ***Encoding***, which is convert categorical to numerical Data 
                    + we will do data **Transformation**
                    + we eill perform **Scaling : Standardization and Normalization**
                    + we wil perform **missing value analysis
        
        ## - Simply feature engineering means our data will be modified.

In [2]:
visa = pd.read_csv(r"C:\Users\prath\FullStackDataScience\my own folder\database\data_files\Visadataset.csv")
visa.head(3)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied

In [5]:
cat = visa.select_dtypes(include="str").columns.tolist()
num = visa.select_dtypes(exclude="str").columns.tolist()

In [6]:
cat

['case_id',
 'continent',
 'education_of_employee',
 'has_job_experience',
 'requires_job_training',
 'region_of_employment',
 'unit_of_wage',
 'full_time_position',
 'case_status']

In [7]:
num

['no_of_employees', 'yr_of_estab', 'prevailing_wage']

### ***Encoding***

            + Encoding means convert categorical data Numerical data 
            + ML/DL or any model works based on maths 
            + Models can not understand english caharaters 
            + so it is very important to convert categorical label to numerical values
            + For examples Gender columns has two tables

                        - Male 
                        - Female

            + Then Female represent as 0 and male represent as 1 based on alphabetical order.